<a href="https://colab.research.google.com/github/jupsimar/Final-Game/blob/main/connecting_data_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#importing pandas library
import pandas as pd
import numpy as np

In [88]:
class color:
   PURPLE = '\033[95m'
   CYAN = '\033[96m'
   DARKCYAN = '\033[36m'
   BLUE = '\033[94m'
   GREEN = '\033[92m'
   YELLOW = '\033[93m'
   RED = '\033[91m'
   BOLD = '\033[1m'
   UNDERLINE = '\033[4m'
   END = '\033[0m'

# List

In [4]:
our_lists= ['Sheepadoodle','Goldendoodle','Border Collie']

In [6]:
for dog in our_lists:
  print(dog)

Sheepadoodle
Goldendoodle
Border Collie

In [7]:
#slicing the list and printing the rest
for dog in our_lists[1:]:
  print(dog)

Goldendoodle
Border Collie

In [8]:
fam =[1.73,1.68,1.71,1.89]

In [15]:
index = 1

for person in fam:
  print(index,fam) 
  index +=1

1 [1.73, 1.68, 1.71, 1.89]
2 [1.73, 1.68, 1.71, 1.89]
3 [1.73, 1.68, 1.71, 1.89]
4 [1.73, 1.68, 1.71, 1.89]

In [20]:
#enumerator
print(index)
for index, height in enumerate(fam, start = 20):
  print("index" + " " + str(index) + ":" + str(height))

3
index 20:1.73
index 21:1.68
index 22:1.71
index 23:1.89

In [26]:
cities = ['London', 'Paris', 'Berlin', 'Warsaw']
index =1
for index, height in enumerate(cities):
  index +=1
  print(index, height)

1 London
2 Paris
3 Berlin
4 Warsaw

In [36]:
shed_measurements =[[2,1],[3,2],[4,8]]

for width,length in shed_measurements:
  print(str(width) + " by " + str(length))

2 by 1
3 by 2
4 by 8

In [45]:
veh_data = [['vehicle', 'year', 'price'],
           ['Tesla XXXX', '2019', '49900'],
           ['Hyundai XXXX', '2020', '30315'],
           ['Chevy XXXX', '2018', '36620']]

for vehicle in veh_data[1:]:

  vehicle[1]=int(vehicle[1])
  print(vehicle[1])

2019
2020
2018

In [49]:
#calculating the average price

total_price = 0

for row in veh_data[1:]:
  price = int(row[2])
  row[2] = price
  total_price += price

number_of_cars = len (veh_data[1:])
print(total_price/number_of_cars)

38945.0

In [51]:
# initialize list of lists 
data = [['Sarah', 10,'American'], ['Thomas', 15,'Dutch'], ['Nicky', 14, 'German']] 

first_row = ['Name', 'Age', 'Nationality']

print(data)
print(first_row)

#creating a dataframe

df = pd.DataFrame(data , columns=first_row)
df

[['Sarah', 10, 'American'], ['Thomas', 15, 'Dutch'], ['Nicky', 14, 'German']]
['Name', 'Age', 'Nationality']

     Name  Age Nationality
0   Sarah   10    American
1  Thomas   15       Dutch
2   Nicky   14      German

In [52]:
df.dtypes

Name           object
Age             int64
Nationality    object
dtype: object

In [55]:
for ind in df.index:
  print(df['Name'][ind],df['Age'][ind])

Sarah 10
Thomas 15
Nicky 14

In [57]:
#loc[]  method to iterate through dataframe

for i in range (len(df)) :
  print(df.loc[i,'Name'],df.loc[i,"Age"])

Sarah 10
Thomas 15
Nicky 14

In [59]:
column_names = ['page','article name','format','revenue','total engagement']
rows = [['Aunty Acid', 'article 1','story',123, 1045],['Diply', 'article 2','story',89, 700],['Diply Hello', 'article 3','listicle',151, 1047],
        ['Aunty Acid', 'article 4','listicle',87, 945],['Aunty Acid', 'article 5','listicle',313, 1304],['Diply', 'article 6','listicle',99, 705],
        ['Diply Hello', 'article 7','story',150, 870],['Diply Hello', 'article 8','listicle',423, 2004],['Diply', 'article 9','listicle',178, 3521],
        ['Diply', 'article 10','listicle',217, 2000],['Aunty Acid', 'article 11','story',123, 8007],['Diply Hello', 'article 12','story',121, 1809]
        ]

df_diply = pd.DataFrame(rows,columns= column_names)
df_diply

           page article name    format  revenue  total engagement
0    Aunty Acid    article 1     story      123              1045
1         Diply    article 2     story       89               700
2   Diply Hello    article 3  listicle      151              1047
3    Aunty Acid    article 4  listicle       87               945
4    Aunty Acid    article 5  listicle      313              1304
5         Diply    article 6  listicle       99               705
6   Diply Hello    article 7     story      150               870
7   Diply Hello    article 8  listicle      423              2004
8         Diply    article 9  listicle      178              3521
9         Diply   article 10  listicle      217              2000
10   Aunty Acid   article 11     story      123              8007
11  Diply Hello   article 12     story      121              1809

In [60]:
df_diply.shape

(12, 5)

In [62]:
df_diply.head(2)

         page article name format  revenue  total engagement
0  Aunty Acid    article 1  story      123              1045
1       Diply    article 2  story       89               700

In [70]:
#looping through different columns (across the full dataframes)
print('Average\n')
for col in np.array(['revenue','total engagement']):
  print(df_diply[col].mean())

Average

172.83333333333334
1996.4166666666667

In [86]:
for p in df_diply.page.unique():
  page = df_diply[df_diply.page==p]
  display(page)

          page article name    format  revenue  total engagement
0   Aunty Acid    article 1     story      123              1045
3   Aunty Acid    article 4  listicle       87               945
4   Aunty Acid    article 5  listicle      313              1304
10  Aunty Acid   article 11     story      123              8007

    page article name    format  revenue  total engagement
1  Diply    article 2     story       89               700
5  Diply    article 6  listicle       99               705
8  Diply    article 9  listicle      178              3521
9  Diply   article 10  listicle      217              2000

           page article name    format  revenue  total engagement
2   Diply Hello    article 3  listicle      151              1047
6   Diply Hello    article 7     story      150               870
7   Diply Hello    article 8  listicle      423              2004
11  Diply Hello   article 12     story      121              1809

In [92]:
for p in df_diply.page.unique():
  df_page = df_diply[df_diply.page==p]
  for col in np.array(['revenue','total engagement']):
    print(round(df_diply[col].mean(),2))

#Another code
for p in df_diply.page.unique():
  df_page = df_diply[df_diply.page==p]
  #display(df_page)
  print(color.BOLD + color.PURPLE+p+color.END)
  for col in np.array(['revenue','total engagement']):
    print(color.BOLD+col+color.END)
    print(round(df_diply[col].mean(),2))

172.83
1996.42
172.83
1996.42
172.83
1996.42
Aunty Acid
revenue
172.83
total engagement
1996.42
Diply
revenue
172.83
total engagement
1996.42
Diply Hello
revenue
172.83
total engagement
1996.42